{
  "version": "2.0",
  "rectangles": [
    {
      "id": "template-rect-1753691244993-1",
      "x": 35,
      "y": 16,
      "w": 133,
      "h": 9,
      "label": "Channels",
      "color": "#919597",
      "type": "root",
      "description": "The Channels Domain encompasses the various ways in which an organization interacts with its customers to facilitate access to services and products. This domain leverages multiple resources, including people, digital platforms, communication tools, and physical locations, to ensure a seamless customer experience. By integrating human channels like contact centers and branch services with digital self-service options such as mobile apps and online banking, the Channels Domain aims to deliver convenience and efficiency. It also supports external collaboration through Open Banking APIs and third-party authentication services, enhancing the overall customer engagement strategy.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "7410b0e5-0b2e-40ea-9d47-7028046c7f3c"
      },
      "isManualPositioningEnabled": false,
      "isLockedAsIs": true
    },
    {
      "id": "template-rect-1753691244993-2",
      "parentId": "template-rect-1753691244993-1",
      "x": 110,
      "y": 19,
      "w": 20,
      "h": 5,
      "label": "Human Channels",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Human Channels Domain encompasses a variety of personal interaction mechanisms that facilitate direct communication and service delivery to customers. This domain integrates multiple resources including personnel, processes, and technologies to enhance customer experiences through avenues such as help desks, contact centers, and physical and digital banking interfaces. By leveraging these channels, organizations aim to provide timely assistance, foster stronger relationships, and ensure seamless transactions, all of which contribute to customer satisfaction and loyalty in today’s competitive landscape.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "fd2026e6-cb4a-4568-a7cb-9189b66c3211"
      }
    },
    {
      "id": "template-rect-1753691244993-3",
      "parentId": "template-rect-1753691244993-1",
      "x": 86,
      "y": 19,
      "w": 20,
      "h": 5,
      "label": "ATMs",
      "color": "#ededed",
      "type": "leaf",
      "description": "The ATMs Domain encompasses the operation of Automated Teller Machines that serve as a customer interface for banking services. This Domain enables clients to perform essential financial transactions such as withdrawing and depositing cash in both local and foreign currencies, checking account balances, and executing other fundamental account-related inquiries. The functionality of ATMs is supported by a robust combination of technologies, information systems, and well-defined processes, coupled with skilled personnel ensuring consistent availability and security for users. This enhances customer convenience and accessibility to banking services, aligning with the evolving needs of today's financial landscape.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "2955047a-f2cb-4a3a-9846-0c9e438850dc"
      }
    },
    {
      "id": "template-rect-1753691244993-4",
      "parentId": "template-rect-1753691244993-1",
      "x": 36,
      "y": 19,
      "w": 20,
      "h": 5,
      "label": "Digital Self-Service Channels",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Digital Self-Service Channels Domain encompasses a suite of online platforms designed to provide customers with seamless access to banking services and information. This domain integrates various technologies and processes to facilitate user-friendly interactions, enabling clients to manage their accounts, execute transactions, and access insights without the need for physical branch visits. By leveraging web and mobile banking solutions, along with real-time chat and external information exchange systems, this domain enhances customer engagement while ensuring efficient data management and security throughout the service delivery cycle. It is supported by a skilled workforce, robust IT infrastructure, and extensive user experience design, collectively working to meet contemporary customer expectations and drive satisfaction.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "4a773b47-498c-4324-a32a-6660ba09f09e"
      }
    },
    {
      "id": "template-rect-1753691244993-5",
      "parentId": "template-rect-1753691244993-1",
      "x": 61,
      "y": 19,
      "w": 20,
      "h": 5,
      "label": "Communication Channels",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Communication Channels Domain encompasses a range of mediums that facilitate engagement and interaction between customers and the organization. This Domain integrates various resources including people, processes, information, and technologies to ensure effective dialogue through online meetings, chat services, electronic mail, SMS, and traditional mail. By leveraging these diverse channels, the organization delivers timely and relevant communication, enhancing customer experience and satisfaction while supporting its strategic objectives in a seamless and accessible manner.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "2a5dec2a-ebc0-4822-b94a-0854188cfc30"
      }
    },
    {
      "id": "template-rect-1753691495998-1",
      "x": 35,
      "y": 26,
      "w": 22,
      "h": 45,
      "label": "Relationships",
      "color": "#87CEEB",
      "type": "root",
      "description": "The Relationships domain encompasses the management of interactions and dynamics between individuals, businesses, and organizations connected to the Group's entities. This domain emphasizes the facilitation of partnerships, customer engagements, and involved parties, ensuring alignment of roles and mandates. By integrating processes for customer onboarding, preference management, customer segmentation, and complaint resolution, the Relationships domain enhances customer satisfaction and loyalty. It draws on resources such as skilled personnel, effective process management, comprehensive information systems, and enabling technologies to deliver a cohesive, customer-centric experience, ultimately driving business success.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "e7254893-ef18-4877-816c-d64dc965fb04"
      },
      "layoutPreferences": {
        "fillStrategy": "fill-columns-first",
        "maxRows": 4
      },
      "isManualPositioningEnabled": false,
      "isLockedAsIs": true
    },
    {
      "id": "template-rect-1753691495998-2",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Customer Relationship Management",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Customer Relationship Management domain focuses on building and maintaining strong relationships with customers by understanding their needs, preferences, and behaviors. This domain enhances customer satisfaction and loyalty by leveraging resources such as information management to store customer data and insights, processes for streamlined engagement, and technologies that facilitate personalized interactions. Additionally, it encompasses activities that include welcoming new customers, managing complaints, and tracking customer agreements, which together foster an effective environment for continuous customer engagement, thus delivering tailored value propositions.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "def27fe6-1c7c-4852-ba0f-4e06e3c66163"
      }
    },
    {
      "id": "template-rect-1753691495998-3",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Sales",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Sales Domain encompasses the strategies and interactions that drive revenue generation by connecting with customers and fulfilling their financial needs. This domain leverages a combination of skilled professionals, advanced technologies, and robust processes to identify, nurture, and convert leads into loyal customers. By employing data analytics and customer relationship management tools, the domain enhances customer engagement and satisfaction, ensuring that offerings align with client preferences. Ultimately, this integrated approach not only accelerates sales but also strengthens relationships, enhancing the overall value proposition of the organization.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "0a285f77-bf50-410b-85fa-4bc9903f41fd"
      }
    },
    {
      "id": "template-rect-1753691495998-4",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Partner Relationship Management",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Partner Relationship Management Domain focuses on fostering and nurturing relationships with external partners to enhance collaborative opportunities and mutual business growth. This domain encompasses the management of partnership programs, which include the design, execution, and monitoring of collaborative agreements; relationship governance to ensure strategic alignment and compliance; and performance assessment to identify successes and areas for enhancement. By leveraging various resources—such as skilled personnel, comprehensive processes, relevant information systems, and advanced technologies—organizations can effectively manage their partnerships, driving value both for themselves and their partners.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "7aab32d8-639e-4754-97fb-1d4d6ad4a38b"
      }
    },
    {
      "id": "template-rect-1753691495998-5",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "Involved Parties",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Involved Parties domain encompasses all individuals, businesses, and organizations engaged with the Group, facilitating structured interactions through defined roles and mandates. This domain manages the relationships between the Group and its stakeholders, ensuring clarity in roles such as corporate employees authorized to handle accounts or businesses serving as legal entities within the Group. It leverages a combination of resources—people to foster engagement, processes to streamline interactions, and information systems to maintain accurate records of roles and relationships—ultimately enhancing customer satisfaction and operational efficiency. By continuously optimizing these connections, the Involved Parties domain supports seamless collaboration and dynamic engagement with existing and potential partners.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "0f020a68-a6cc-4560-8140-1eaff7b139e3"
      }
    },
    {
      "id": "rect-1",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Customer Care",
      "color": "#ededed",
      "type": "leaf",
      "isEditing": false,
      "isLockedAsIs": false
    },
    {
      "id": "rect-2",
      "parentId": "template-rect-1753691495998-1",
      "x": 36,
      "y": 59,
      "w": 20,
      "h": 5,
      "label": "End of Relationship",
      "color": "#ededed",
      "type": "leaf",
      "isEditing": false,
      "isLockedAsIs": false
    },
    {
      "id": "template-rect-1753696864166-1",
      "x": 58,
      "y": 26,
      "w": 43,
      "h": 45,
      "label": "Products & Services",
      "color": "#7dca90",
      "type": "root",
      "description": "The Products & Services Domain encompasses the creation, management, and delivery of a diverse range of financial solutions that fulfill customer needs across various segments. This domain integrates multiple resources including skilled personnel, essential processes, comprehensive information management, state-of-the-art technologies, and relevant applications to offer financing options, investment products, and related banking services. By leveraging these capabilities, the Products & Services Domain ensures that customers have access to tailored financial offerings that support their personal and business objectives, ultimately driving customer satisfaction and loyalty.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "1771bff7-d36b-43e1-8825-55dbec75246f"
      },
      "isManualPositioningEnabled": false,
      "isLockedAsIs": true
    },
    {
      "id": "template-rect-1753696864166-2",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Corporate Finance",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Corporate Finance Domain encompasses the strategic management of funding and capital structure within organizations, focusing on capital budgeting, sourcing, and working capital management. This domain involves activities such as investment funding, mergers and acquisitions, and initial public offerings (IPOs), alongside effective asset and liability management to optimize operational efficiency. By leveraging a combination of skilled professionals, structured processes, insightful financial data, and advanced technologies, the Corporate Finance Domain equips organizations to make informed financial decisions, enhancing their value proposition and ensuring sustainable growth.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "14154433-48f8-4445-8b89-86e37d44cd2b"
      }
    },
    {
      "id": "template-rect-1753696864166-3",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Financial Markets",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Financial Markets Domain encompasses a comprehensive suite of activities aimed at effectively managing and executing transactions related to financial securities and derivatives. This includes overseeing trade execution, managing settlements and clearances, handling custodial accounts, and facilitating critical corporate actions affecting listed securities. By integrating advanced technologies and financial information systems, this domain ensures efficient trading operations, supports strategic investment decisions, and aligns with regulatory requirements. The capabilities within this domain leverage a blend of skilled personnel, well-defined processes, accurate financial information, and robust trading infrastructures to deliver value to customers and maintain competitive advantages in the marketplace.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "88820b69-edcd-4597-bb44-c8730b33afc5"
      }
    },
    {
      "id": "template-rect-1753696864166-4",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Investment Services",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Investment Services Domain encompasses a comprehensive suite of services aimed at managing and optimizing customer investments to align with their financial goals. This domain employs a robust operating model that synergizes skilled personnel, effective processes, and advanced information technologies, facilitating investment portfolio planning, management, and ongoing performance analysis. By addressing both regulatory obligations and individual client needs, this domain empowers customers to make informed investment decisions while enhancing their engagement with investment products and services. Ultimately, it strives to deliver significant value by fostering customer trust and satisfaction through tailored investment strategies and diligent portfolio oversight.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "7ea6c1bd-0a67-4bd0-85d2-3fd882f2f496"
      }
    },
    {
      "id": "template-rect-1753696864166-5",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Financing",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Financing Domain encompasses a comprehensive suite of services and products designed to provide financial support across various customer segments, including personal, business, and institutional clients. This domain manages a variety of financing solutions such as real estate and trade financing, consumer and business loans, and asset financing, leveraging a mix of people, processes, information, and technologies to optimize cash flow and meet customers' diverse financial needs. By aligning product capabilities with lifecycle processes and robust risk management strategies, the Financing Domain delivers tailored financial solutions that enhance liquidity and facilitate growth for its users.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "bdd6ce6e-69f1-4f0b-a350-2516ebc6110a"
      }
    },
    {
      "id": "template-rect-1753696864166-6",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 59,
      "w": 20,
      "h": 5,
      "label": "Investment Products",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Investment Products Domain encompasses the management and administration of various investment vehicles designed to meet the diverse needs of customers. This domain includes crucial activities such as mutual fund oversight, institutional investment services, and the execution of investment management strategies. By leveraging a combination of skilled professionals, robust processes, and advanced technologies, this domain aims to deliver tailored investment solutions that optimize financial returns while ensuring compliance with regulatory standards and risk management protocols. This holistic approach aligns with organizational goals to foster customer satisfaction and drive competitive advantage in the financial markets.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "2a2e4762-2ad8-469f-948d-998927bf58bc"
      }
    },
    {
      "id": "template-rect-1753696864166-7",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "Accounts",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Accounts Domain encompasses the management and operation of various financial accounts, facilitating seamless transactions, and ensuring accurate financial reporting. It delivers value through the systematic administration of account products, including the establishment of interest applications, fees management, and the maintenance of account infrastructures that support both standalone and integrated financial services. This domain leverages a combination of skilled personnel, streamlined processes, accurate information systems, and advanced technologies to enhance customer experiences and operational efficiency, ultimately driving improved financial outcomes for clients and the organization alike.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "fb644380-0925-435c-83b0-a1e7c4ba566b"
      }
    },
    {
      "id": "template-rect-1753696864166-8",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Cash Management",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Cash Management Domain is designed to optimize financial resources by effectively managing cash flows across various accounts. It encompasses activities such as liquidity management, which aims to mitigate liquidity risk, and cash pooling to streamline necessary capital costs. By leveraging structured processes, advanced technologies, and informed decision-making, organizations enhance their operational efficiency and better meet client demands. This domain integrates key resources such as personnel trained in financial management, information systems for real-time tracking, and technologies that facilitate seamless payment execution and risk assessment, collectively ensuring that cash is available and utilized effectively to support business objectives.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "1dd9e2cb-4bdc-4178-9181-6585767dcb40"
      }
    },
    {
      "id": "template-rect-1753696864166-9",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 59,
      "w": 20,
      "h": 5,
      "label": "Payments",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Payments Domain focuses on managing the entire lifecycle of payment processes, ensuring seamless execution and integrity of financial transactions. This includes the validation and authorization of payment requests, managing the clearing and settlement of transactions with banks and clearing networks, and providing robust servicing that monitors payment activities to address any exceptions or discrepancies. By leveraging a combination of skilled personnel, streamlined processes, and advanced technologies, this Domain delivers a secure and efficient payment infrastructure that enhances customer experience and supports the financial organization's operational efficiency.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "3a9e2ebf-a9ff-4da2-a4a8-8a25e4f9de81"
      }
    },
    {
      "id": "template-rect-1753696864166-10",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "Insurance",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Insurance domain encompasses the management and provision of various insurance products, aimed at minimizing financial risks for customers by offering protection against unforeseen events. This domain leverages a strategic combination of resources, including experienced personnel, well-defined processes for underwriting and claims management, comprehensive data analytics to assess risks, and advanced technologies for policy administration and customer service. By integrating these resources, organizations enhance their ability to address customer needs effectively and deliver comprehensive insurance solutions that safeguard clients' financial well-being.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "fb7588c5-2481-47d0-8040-de4f6a1bfc39"
      }
    },
    {
      "id": "template-rect-1753696864166-11",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Cards",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Cards Domain encompasses the management and operational facets related to card products, which includes issuing, authorizing, and processing card transactions. It effectively delivers value by designing and maintaining a broad spectrum of card offerings, from credit to loyalty programs, while ensuring robust security measures against fraud. This domain utilizes a combination of personnel, integrated processes, and information technology to oversee the entire card lifecycle, from production and delivery to customer agreements and collection management. By integrating these elements, the Cards Domain not only enhances customer satisfaction through seamless transactions and rewards but also aids in maximizing operational efficiency and compliance with regulatory standards.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "51d124ad-7974-45db-9157-011db3224a64"
      }
    },
    {
      "id": "template-rect-1753696864166-12",
      "parentId": "template-rect-1753696864166-1",
      "x": 80,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Banking Services",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Banking Services Domain encompasses a range of financial solutions designed to meet the diverse needs of individual and business customers. This domain delivers services such as currency exchange, safe deposit box management, cheque handling, and comprehensive consultancy on financial matters, all facilitated by skilled personnel and robust technological systems. By effectively integrating processes for account management and tax reporting, the Banking Services Domain enhances customer satisfaction through personalized financial services and reliable product offerings, ultimately supporting the organization's value proposition to empower financial well-being for its clientele.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "474a3a98-5183-4902-9c23-441c18af2e14"
      }
    },
    {
      "id": "template-rect-1753696864166-13",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Life & Pension",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Life & Pension Domain encompasses the management and delivery of insurance and pension products designed to provide financial security and peace of mind for individuals and families. This domain involves the oversight and administration of life insurance policies, pension savings plans, investment portfolios, and the calculation of risks associated with life and pension agreements. Key resources within this domain include skilled professionals adept in financial management, comprehensive processes for risk assessment and claims handling, advanced information systems for data management and reporting, as well as technology platforms that facilitate customer interaction and product delivery. By effectively integrating these resources, the Life & Pension Domain aims to create tailored financial solutions that address the immediate needs of customers while ensuring long-term financial stability.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "3b1c9508-675c-414d-ae73-3891d7914fad"
      }
    },
    {
      "id": "rect-3",
      "parentId": "template-rect-1753696864166-1",
      "x": 59,
      "y": 65,
      "w": 20,
      "h": 5,
      "label": "Asset Finance",
      "color": "#ededed",
      "type": "leaf",
      "isEditing": false,
      "isLockedAsIs": false
    },
    {
      "id": "template-rect-1753697117536-1",
      "x": 102,
      "y": 26,
      "w": 22,
      "h": 45,
      "label": "Business Support",
      "color": "#87CEEB",
      "type": "root",
      "description": "The Business Support Domain encompasses functionalities that enhance the organization's capacity to deliver services efficiently and respond to customer needs effectively. This domain integrates market data management, product management, and communication strategies by employing resources such as skilled personnel, robust processes, accurate information, and advanced technologies. By optimizing these components, the Business Support Domain plays a critical role in facilitating informed decision-making, fostering operational excellence, and ensuring a high level of customer satisfaction. This alignment between capabilities and strategic goals positions the organization to navigate competitive landscapes successfully and drive sustainable growth.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "273f3256-beff-416a-a9a8-e9284677f070"
      },
      "layoutPreferences": {
        "fillStrategy": "fill-rows-first",
        "maxColumns": 1
      },
      "isManualPositioningEnabled": false,
      "isLockedAsIs": true
    },
    {
      "id": "template-rect-1753697117536-2",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "Market Data",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Market Data Domain encompasses the systematic collection, management, and distribution of various types of market data essential for informed decision-making in financial services. This domain includes crucial information on credit ratings, financial markets, property data, and legal entities, ensuring stakeholders have access to reliable and up-to-date data. By leveraging technology, processes, and skilled personnel, this domain facilitates effective analysis and reporting, enabling companies to respond rapidly to market trends and regulatory requirements while enhancing operational efficiency and customer service.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "9b17a372-8e04-45ae-a9b4-6adf5a29f164"
      }
    },
    {
      "id": "template-rect-1753697117536-3",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Societal Engagement",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Societal Engagement Domain focuses on the bank's commitment to sustainability, environmental responsibility, and social impact, aligning its operations with societal values and customer expectations. This domain encompasses the assessment and enhancement of practices that promote environmental stewardship, sustainable growth, and social responsibility through effective data management and due diligence processes. It leverages a combination of skilled personnel, informed decision-making processes, reliable data, and advanced technologies to support and drive initiatives aimed at fulfilling corporate social responsibilities while ensuring compliance with relevant regulations, ultimately enhancing the organization's reputation and fostering trust among stakeholders.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "9bd21af2-2219-411f-98b5-b0cf28a30d82"
      }
    },
    {
      "id": "template-rect-1753697117536-4",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Product Management",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Product Management Domain encompasses the comprehensive activities involved in the conceptualization, development, and lifecycle management of products. This domain effectively integrates diverse resources, leveraging skilled personnel, streamlined processes, and advanced technologies to understand customer needs, design tailored solutions, and bring them to market. By maintaining a thorough product catalogue and implementing data-driven insights, this domain ensures that products align with strategic business objectives and meet the evolving demands of consumers, ultimately enhancing customer satisfaction and driving organizational success.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "4d9739dd-28cf-4e38-83b7-090ddf282a09"
      }
    },
    {
      "id": "template-rect-1753697117536-5",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Marketing & Communications",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Marketing & Communications Domain focuses on enhancing engagement and relationship management by effectively managing both internal and external communications. This domain delivers value through the strategic dissemination of information, aiming to inform and persuade stakeholders, including employees and customers. It involves a blend of essential resources such as skilled personnel, targeted communication processes, insightful data analytics, and robust technology platforms to create impactful messaging that strengthens brand reputation and fosters loyalty. By aligning marketing efforts with organizational objectives, this domain aids in shaping the customer experience and supports coherent corporate narratives across various channels.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "30ed0767-0834-46ac-b76f-31f65cfeeb7c"
      }
    },
    {
      "id": "template-rect-1753697117536-6",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Enterprise Content Management",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Domain of Enterprise Content Management encompasses the systematic administration of an organization's information assets, facilitating efficient content capture, storage, retrieval, and distribution. By utilizing a blend of people, processes, technologies, and applications, the domain streamlines document management, enhances collaboration, and ensures regulatory compliance. Its focus on delivering value includes optimizing workflows for internal content, managing customer documents effectively, and securing digital signatures, thereby elevating the overall customer experience and operational efficiency. Through a cohesive approach to managing both internal and external content, this domain supports decision-making and strengthens organizational knowledge management practices.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "4fcca068-80d3-42cb-90ab-ba1ead03f212"
      }
    },
    {
      "id": "template-rect-1753697117536-7",
      "parentId": "template-rect-1753697117536-1",
      "x": 103,
      "y": 59,
      "w": 20,
      "h": 5,
      "label": "Business Insight",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Business Insight Domain focuses on the systematic collection and management of data regarding business activities. It encompasses research, reporting, and analysis functions that provide actionable insights and drive informed decision-making. By leveraging a combination of data, technology, skilled personnel, and effective processes, this domain enables organizations to enhance their strategic and operational capabilities, ultimately delivering greater value to stakeholders and clients. It serves as a critical resource for optimizing performance and aligning organizational goals with market demands.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "5509a3c8-0a9b-4540-bc78-8af12aef27fd"
      }
    },
    {
      "id": "template-rect-1753697191404-1",
      "x": 125,
      "y": 26,
      "w": 43,
      "h": 45,
      "label": "Risk Management",
      "color": "#7dca90",
      "type": "root",
      "description": "The Risk Management Domain encompasses the systematic identification, assessment, and prioritization of risks that could potentially impact the organization. This domain leverages a diverse array of enterprise resources, including skilled personnel, established processes, advanced technologies, and comprehensive data management practices to ensure that risks are effectively managed. It operates across various areas such as technology risk, data risk, credit risk, liquidity risk, and market risk, employing a framework that supports informed decision-making and operational resilience. By aligning risk management practices with strategic objectives, organizations can not only mitigate potential threats but also enhance their capacity for sustainable growth and compliance with regulatory requirements.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "9d48cedd-eb49-446b-bf3a-b42eacd5aa9b"
      },
      "layoutPreferences": {
        "fillStrategy": "fill-rows-first",
        "maxColumns": 2
      },
      "isManualPositioningEnabled": true,
      "isLockedAsIs": false
    },
    {
      "id": "template-rect-1753697191404-2",
      "parentId": "template-rect-1753697191404-1",
      "x": 126,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "IT and Security risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The IT and Security Risk Domain encompasses the comprehensive practices and strategies aimed at identifying, assessing, and mitigating technology-related risks that may affect operational integrity. This domain prioritizes the safeguarding of organizational assets, data, and critical applications by fostering a strong culture of awareness, resilience, and compliance with industry standards. Leveraging a synergy of skilled personnel, robust processes, vital information, and cutting-edge technologies, the domain takes a proactive approach to protect against potential threats, enhancing the organization's ability to operate securely and efficiently in the digital landscape. Through continuous monitoring and adaptive security measures, it ensures the organization's resilience against evolving cyber threats while supporting overall business objectives.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "9eddabd9-de80-4c42-8c02-3ce16c779c0a"
      }
    },
    {
      "id": "template-rect-1753697191404-3",
      "parentId": "template-rect-1753697191404-1",
      "x": 147,
      "y": 29,
      "w": 20,
      "h": 5,
      "label": "Data risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Data Risk Domain encompasses the assessment and management of potential losses arising from inadequate or misapplied data insights that can lead to flawed decision-making. This involves ensuring data integrity and quality through robust data architecture, effective governance practices, and ongoing monitoring of data use across the organization. By leveraging skilled personnel, established processes, and the appropriate technologies and applications, this domain plays a critical role in minimizing the risks associated with data mismanagement, thereby enabling informed decision-making and strategic planning that align with the organization's overall objectives.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "cc33ffdc-d44f-4903-8e20-b0d2e9d1d98b"
      }
    },
    {
      "id": "template-rect-1753697191404-4",
      "parentId": "template-rect-1753697191404-1",
      "x": 126,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Credit Risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Credit Risk Domain encompasses the essential activities and frameworks aimed at managing exposure to potential financial losses resulting from a borrower’s failure to meet contractual obligations. This Domain integrates various resources, including skilled personnel, robust processes, and sophisticated information technologies, to evaluate and monitor creditworthiness, establish collateral agreements, and manage impaired debts effectively. Through comprehensive credit assessments, ongoing risk monitoring, and the implementation of strategic policies, this Domain enhances organizational resilience against credit-related vulnerabilities while facilitating informed decision-making in lending practices.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "62b94b33-0f08-4814-baef-bfc6089a7c7f"
      }
    },
    {
      "id": "template-rect-1753697191404-5",
      "parentId": "template-rect-1753697191404-1",
      "x": 147,
      "y": 35,
      "w": 20,
      "h": 5,
      "label": "Liquidity risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Liquidity Risk Domain focuses on the management practices necessary to ensure a sufficient availability of capital and a positive net cash flow within the organization. This involves identifying, assessing, and mitigating risks that may affect the company's ability to meet its financial obligations. By leveraging a combination of financial analysis tools, data insights, operational processes, and risk management technologies, the domain enables organizations to maintain liquidity in various market conditions. This capability not only safeguards against unexpected financial distress but also enhances overall financial stability and operational resilience for stakeholders.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "aca1c2f8-3f50-4977-9acc-a76a285edf9f"
      }
    },
    {
      "id": "template-rect-1753697191404-6",
      "parentId": "template-rect-1753697191404-1",
      "x": 126,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Market Risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Market Risk Domain encompasses the practices and frameworks aimed at identifying, assessing, and mitigating potential losses arising from fluctuations in financial markets. This Domain ensures that an organization maintains its financial stability by adopting a well-defined market risk policy that outlines the parameters of acceptable risk exposure to market movements. It actively integrates a combination of resources—such as skilled personnel, robust processes, accurate information, advanced technologies, and specialized applications—enabling effective monitoring and management of market fluctuations. By strategically managing these risks, the organization enhances its ability to safeguard assets, maintain regulatory compliance, and drive sustainable business growth while securing trust and confidence from stakeholders.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "a42fca2a-34b7-4957-b940-19dc42786c5f"
      }
    },
    {
      "id": "template-rect-1753697191404-7",
      "parentId": "template-rect-1753697191404-1",
      "x": 147,
      "y": 41,
      "w": 20,
      "h": 5,
      "label": "Life insurance & pension risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Life Insurance & Pension Risk domain is focused on managing financial obligations associated with life insurance and pension products. This domain involves assessing and mitigating risks related to the adequacy of funds necessary to meet current and future liabilities. It relies on a combination of resources, including actuarial assessments, regulatory frameworks, financial modeling, and technology systems. By leveraging accurate data and sound risk management practices, this domain ensures that the organization can fulfill its commitments to policyholders and beneficiaries, thereby enhancing overall financial stability and customer trust.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "4c9c8f41-ffd6-47f0-b554-ddfad41c9de5"
      }
    },
    {
      "id": "template-rect-1753697191404-8",
      "parentId": "template-rect-1753697191404-1",
      "x": 126,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Operational risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Operational Risk Domain encompasses the proactive identification, assessment, monitoring, and mitigation of risks arising from potential failures in internal processes, people, systems, or external events. It serves to safeguard organizational integrity and ensure compliance with regulatory frameworks by leveraging a combination of key resources, including skilled personnel, robust processes, comprehensive data analytics, and advanced technologies. By meticulously managing operational risks, organizations can enhance their resilience, protect their reputation, and ultimately deliver greater value to stakeholders while fostering a culture of risk awareness and continuous improvement.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "af88fa53-8dc5-454a-b2ad-744e903dcf2e"
      }
    },
    {
      "id": "template-rect-1753697191404-9",
      "parentId": "template-rect-1753697191404-1",
      "x": 147,
      "y": 47,
      "w": 20,
      "h": 5,
      "label": "Regulatory compliance risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Regulatory Compliance Risk domain encompasses the proactive measures taken to manage and mitigate risks associated with regulatory requirements and compliance obligations. This domain relies on a combination of structured processes, advanced information systems, skilled personnel, and regulatory knowledge, ensuring that organizations adhere to pertinent laws and regulations. It involves activities such as compliance monitoring, risk assessments, and interaction with regulatory authorities, which collectively support sustained operational integrity and promote trust in financial practices. By utilizing technology and data analytics, organizations can enhance their ability to respond to regulatory changes and avoid potential penalties, thereby safeguarding their reputation and financial stability.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "415387c9-e7ea-4a4e-b5ba-52cf4d973243"
      }
    },
    {
      "id": "template-rect-1753697191404-10",
      "parentId": "template-rect-1753697191404-1",
      "x": 126,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Strategic risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Strategic Risk Domain encompasses the management practices aimed at mitigating losses resulting from failures in strategic direction setting and execution, alongside compliance with accounting standards and tax reporting requirements. This domain leverages a combination of resources, including skilled personnel to analyze strategic initiatives, processes to monitor progress and compliance, and information systems to track regulatory obligations. By integrating these elements, organizations can enhance their decision-making processes and reduce the adverse impacts associated with strategic missteps in a rapidly changing business environment.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "ca9ad94e-7004-4c20-89c2-2ad87cacf771"
      }
    },
    {
      "id": "template-rect-1753697191404-11",
      "parentId": "template-rect-1753697191404-1",
      "x": 147,
      "y": 53,
      "w": 20,
      "h": 5,
      "label": "Financial crime risk",
      "color": "#ededed",
      "type": "leaf",
      "description": "The Financial Crime Risk Domain encompasses a comprehensive strategy for mitigating losses associated with financial crime. This domain focuses on identifying, assessing, and managing risks related to financial crimes such as fraud, money laundering, and compliance breaches. It integrates various resources, including skilled personnel, robust processes, accurate information, advanced technologies, and specialized applications to effectively monitor and respond to potential threats. By implementing strict oversight, continuous monitoring, and dynamic reporting capabilities, the Financial Crime Risk Domain protects both the organization and its clients, ensuring adherence to regulatory requirements while promoting a secure financial environment.",
      "metadata": {
        "tags": [
          "template"
        ],
        "templateId": "2f338787-588f-409e-a93d-993e615b7fda"
      }
    }
  ],
  "globalSettings": {
    "gridSize": 10,
    "leafFixedWidth": false,
    "leafFixedHeight": false,
    "leafWidth": 4,
    "leafHeight": 3,
    "rootFontSize": 12,
    "dynamicFontSizing": true,
    "fontFamily": "Inter",
    "borderRadius": 8,
    "borderColor": "#374151",
    "borderWidth": 2,
    "margin": 1,
    "labelMargin": 2,
    "layoutAlgorithm": "grid",
    "predefinedColors": [
      "#87CEEB",
      "#98D8C8",
      "#D8BFD8",
      "#F0E68C",
      "#FFB6C1",
      "#B0E0E6",
      "#4ECDC4",
      "#45B7D1",
      "#96CEB4",
      "#FFEAA7",
      "#DDA0DD",
      "#F7DC6F",
      "#BB8FCE",
      "#85C1E9",
      "#F8C471",
      "#82E0AA"
    ]
  },
  "layoutMetadata": {
    "algorithm": "grid",
    "isUserArranged": true,
    "preservePositions": true,
    "boundingBox": {
      "w": 133,
      "h": 55
    }
  },
  "timestamp": 1753712194965
}